Repository: temoki/TortoiseBlocks
Catalog: App/Localizable.xcstrings
Source language: en
Languages: ja

source: Add Here
ja: ここへついか

source: Add Otherwise
ja: そうでなければをついか

source: Add to Box
ja: はこにたす

source: Adds an otherwise mouth that runs when the condition fails
ja: じょうけんがちがうときにうごく「そうでなければ」をついかします

source: Back to Start
ja: さいしょにもどる

source: Backward
ja: うしろへ

source: black
ja: くろ

source: blue
ja: あお

source: Box
ja: はこ

source: Box %@
ja: はこ %@

source: Build with Blocks
ja: ブロックをならべよう

source: Canvas
ja: キャンバス

source: Clear
ja: けす

source: Code
ja: コード

source: Color %@
ja: いろ %@

source: Comparison
ja: くらべかた

source: Condition %@
ja: じょうけん %@

source: Control
ja: せいぎょ

source: Copy Code
ja: コードをコピー

source: cyan
ja: みずいろ

source: Delete
ja: けす

source: Dice
ja: サイコロ

source: Divide Box
ja: はこをわる

source: Drawing
ja: さくひん

source: Drop Here
ja: ここへドロップ

source: Drop to Delete
ja: ドロップしてけす

source: End Fill
ja: ぬりおわり

source: equal to
ja: とおなじ

source: Export
ja: かきだす

source: Export PNG…
ja: PNG をかきだす…

source: Export SVG…
ja: SVG をかきだす…

source: Fill
ja: ぬり

source: Fill Color
ja: ぬりのいろ

source: Forward
ja: まえへ

source: Go Home
ja: ホームへもどる

source: greater than
ja: よりおおきい

source: green
ja: みどり

source: If
ja: もし

source: Instant
ja: すぐに

source: less than
ja: よりちいさい

source: magenta
ja: マゼンタ

source: Maximum
ja: さいだい

source: Minimum
ja: さいしょう

source: Motion
ja: うごき

source: Move Down
ja: したへ

source: Move Up
ja: うえへ

source: Multiply Box
ja: はこにかける

source: New Drawing
ja: あたらしく つくる

source: New Name
ja: あたらしいなまえ

source: Nothing to play
ja: まだ なにも うごかしていません

source: Number
ja: すうじ

source: Number %@
ja: すうじ %@

source: OK
ja: わかった

source: or less
ja: いか

source: or more
ja: いじょう

source: orange
ja: オレンジ

source: Otherwise
ja: そうでなければ

source: Pause
ja: いちじていし

source: Pen
ja: ペン

source: Pen Color
ja: ペンのいろ

source: Pen Down
ja: ペンをおろす

source: Pen Up
ja: ペンをあげる

source: Pen Width
ja: ペンのふとさ

source: Play
ja: さいせい

source: Play Again
ja: もういちど さいせい

source: Position
ja: さいせいいち

source: purple
ja: むらさき

source: Put in Box
ja: はこにいれる

source: red
ja: あか

source: Redo
ja: やりなおす

source: Remove Otherwise
ja: そうでなければをけす

source: Repeat
ja: くりかえす

source: Resume
ja: さいかい

source: Roll Again
ja: ふりなおす

source: Run
ja: うごかす

source: Running
ja: じっこうちゅう

source: Runs the program again, rolling any dice for new values
ja: もういちど うごかします。サイコロは ふりなおされます

source: Sample: Filled Square
ja: サンプル: しかくをぬる

source: Sample: Spiral
ja: サンプル: うずまきをかく

source: Sample: Star
ja: サンプル: ほしをかく

source: Share PNG
ja: PNG をきょうゆう

source: Share SVG
ja: SVG をきょうゆう

source: Speed
ja: はやさ

source: Start Fill
ja: ぬりはじめ

source: Step %lld of %lld
ja: %lld / %lld こめ

source: Step Back
ja: いっぽもどる

source: Step Forward
ja: いっぽすすむ

source: Subtract from Box
ja: はこからひく

source: Tap a palette block, or drag one here
ja: パレットのブロックをタップするか ここへドラッグしてね

source: Tap to add to the end of the program. Drag to place anywhere.
ja: タップでプログラムのさいごについか。ドラッグですきなばしょへ

source: Tap to change the condition
ja: タップしてじょうけんをかえます

source: Tap to change the number
ja: タップしてすうじをかえます

source: Tap to choose a box
ja: タップしてはこをえらびます

source: Tap to choose a color
ja: タップしていろをえらびます

source: Tap to choose a comparison
ja: タップしてくらべかたをえらびます

source: then
ja: なら

source: This file was made with a newer version of TortoiseBlocks.
ja: あたらしいバージョンの TortoiseBlocks でつくられたファイルです。

source: times
ja: かい

source: Too Many Blocks!
ja: ブロックがおおすぎるよ

source: Try a smaller repeat count.
ja: くりかえしのかずをちいさくしてみてね

source: Turn Left
ja: ひだりへまわる

source: Turn Right
ja: みぎへまわる

source: Type
ja: しゅるい

source: Undo
ja: もどす

source: Use
ja: つかう

source: Value of box %@
ja: はこ %@ のなかみ

source: Variables
ja: へんすう

source: View
ja: ひょうじ

source: When on, new palette blocks go inside this block
ja: オンにするとパレットのブロックがこのなかにはいります

source: white
ja: しろ

source: yellow
ja: きいろ
